while True:
    meme_dict = {
                "КРИНЖ": "Что-то очень странное или стыдное",
                "ЛОЛ": "Что-то очень смешное",
                "РОФЛ": "Шутка",
                "ЩИЩ": "Одобрение, восторг",
                "КРИПОВЫЙ": "Страшный, пугающий",
                "АГРИТЬСЯ": "Злиться"
                }
    word = input("Введите непонятное слово (большими буквами!);(если хотите остановиться, напишите ХВАТИТ): ")
    if word in meme_dict.keys():
        # Что делать, если слово нашлось?
        print(meme_dict[word])
    if word == "ХВАТИТ":
        break
    else:
        # Что делать, если слово не нашлось?
        print("Такого слова нет! Попробуйте ещё раз")
